.data/referenceCase/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  12                                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.225;

boundaryField
{
    inlet
    {
        type            calculated;
        value          uniform 1.225;
    }
    outlet
    {
        type            calculated;
        value          uniform 1.225;
    }
    walls
    {
        type            calculated;
        value          uniform 1.225;
    }
    rocket
    {
        type            calculated;
        value          uniform 1.225;
    }
}