.data/referenceCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          625;
        startFace       127868;
    }
    outlet
    {
        type            patch;
        nFaces          625;
        startFace       128493;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5000;
        startFace       129118;
    }
    rocket
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          822;
        startFace       134118;
    }
)

// ************************************************************************* //
