.data/referenceCase/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  12                                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo         janaf;
    equationOfState perfectGas;
    specie         specie;
    energy         sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight       28.9;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.57304 -0.000736182 1.99715e-06 -2.48066e-09 1.0439e-12 -1047.41 3.12431 );
        lowCpCoeffs     ( 3.09589 0.00121307 -4.23164e-06 6.52475e-09 -2.21205e-12 -998.478 5.98321 );
    }
    transport
    {
        As              1.458e-06;
        Ts              110.4;
    }
}