.data/referenceCase/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-50 -50 -100)  // punto 0
    ( 50 -50 -100)  // punto 1
    ( 50  50 -100)  // punto 2
    (-50  50 -100)  // punto 3
    (-50 -50  100)  // punto 4
    ( 50 -50  100)  // punto 5
    ( 50  50  100)  // punto 6
    (-50  50  100)  // punto 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 25 50) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 5 4 0)
            (2 1 5 6)
            (3 2 6 7)
        );
    }
);