.data/referenceCase/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

surfaces
(
    "rocket.stl"
);

includedAngle   150;

subsetFeatures
{
    nonManifoldEdges       yes;
    openEdges              yes;
}

writeObj                yes;